/*
                        Задание 1
- Создать Git репозиторий.
- Создать первый проект. Я создал на базе framework Maven. (version SDK 1.8 ).
- Реализация первого метода через ( System.out.println ).
 */
public class Solution {
    public static void main(String[] args) {
        System.out.println("Привет группа FreeIT !");
        System.out.print("Меня зовут Александр, ");
        System.out.println("буду рад взаимной помощи в домашних заданиях.");
        System.out.println("Успехов в освоении Java !!!");
    }
}
